app/Controllers/admin/Aktivitas.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }
        $aktivitasModel = new AktivitasModel();
        $all_data_aktivitas = $aktivitasModel->findAll();
---
SELECT *
FROM `tb_aktivitas`