app/Controllers/user/Aktivitasctrl.php

SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Aktivitas'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_aktivitas`
---
    public function index()
    {
        $lang = session()->get('lang') ?? 'en';

        $meta = $this->MetaModel->where('nama_halaman', 'Aktivitas')->first();
        // var_dump($meta);
        // die();
        $canonicalUrl = base_url('activities');

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findAll(),
            'meta' => $meta,
            'lang' => $lang,
        ];

SELECT *
FROM `tb_aktivitas`
WHERE `slug_id` = 'kontes-resep-kue-kering'
OR `slug_en` = 'kontes-resep-kue-kering'
 LIMIT 1
---
    public function detail($slug_aktivitas)
    {
        $lang = session()->get('lang') ?? 'en';

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->where('slug_id', $slug_aktivitas)
                ->orWhere('slug_en', $slug_aktivitas)
                ->first(),