app/Controllers/user/Homectrl.php

    public function index()
    {
        $lang = session()->get('lang') ?? 'en';


        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(), // Fetch the latest articles
            'lang' => $lang
        ];

        $data['Title'] = $data['profil'][0]->title_website;

        helper('text');

        if (session('lang') === 'id') {
            $teks = strip_tags($data['profil'][0]->deskripsi_perusahaan_in);
        } else {
            $teks = strip_tags($data['profil'][0]->deskripsi_perusahaan_en);
        }

        $batasan = 150;
        $data['Meta'] = character_limiter($teks, $batasan);

        // SEO
        $meta = $this->MetaModel->where('nama_halaman', 'Beranda')->first(); // Ambil meta untuk halaman Home
---
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Beranda'
 LIMIT 1