app/Controllers/user/Productsctrl.php

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Product'
 LIMIT 1
---
    public function index()
    {
        $lang = session()->get('lang') ?? 'en';

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'lang' => $lang
        ];

        // SEO
        $meta = $this->MetaModel->where('nama_halaman', 'Product')->first();

SELECT *
FROM `tb_produk`
WHERE `slug_id` = 'roti-gandum-sehat'
OR `slug_en` = 'roti-gandum-sehat'
 LIMIT 1
---
    public function detail($slug_produk)
    {
        $lang = session()->get('lang') ?? 'en';

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbproduk' => $this->ProdukModel->where('slug_id', $slug_produk)
                ->orWhere('slug_en', $slug_produk)
                ->first(),